; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=60, out_folder=htg/blocksworld//training, instance_id=40, seed=2064

(define (problem blocksworld-40)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 - object)
 (:init 
    (arm-empty)
    (clear b45)
    (on b45 b53)
    (on b53 b36)
    (on b36 b25)
    (on b25 b56)
    (on b56 b42)
    (on b42 b54)
    (on-table b54)
    (clear b28)
    (on b28 b44)
    (on b44 b12)
    (on b12 b38)
    (on-table b38)
    (clear b15)
    (on b15 b7)
    (on b7 b10)
    (on b10 b60)
    (on-table b60)
    (clear b8)
    (on b8 b18)
    (on-table b18)
    (clear b49)
    (on b49 b52)
    (on b52 b41)
    (on b41 b37)
    (on b37 b1)
    (on b1 b11)
    (on b11 b33)
    (on b33 b26)
    (on b26 b27)
    (on b27 b24)
    (on-table b24)
    (clear b40)
    (on b40 b16)
    (on b16 b59)
    (on-table b59)
    (clear b32)
    (on b32 b57)
    (on b57 b47)
    (on b47 b22)
    (on b22 b3)
    (on b3 b5)
    (on b5 b9)
    (on b9 b2)
    (on b2 b23)
    (on b23 b51)
    (on b51 b14)
    (on b14 b34)
    (on b34 b35)
    (on b35 b17)
    (on b17 b19)
    (on b19 b13)
    (on b13 b4)
    (on b4 b55)
    (on b55 b29)
    (on b29 b50)
    (on b50 b21)
    (on b21 b39)
    (on b39 b58)
    (on b58 b31)
    (on-table b31)
    (clear b30)
    (on b30 b6)
    (on b6 b48)
    (on b48 b43)
    (on b43 b20)
    (on-table b20)
    (clear b46)
    (on-table b46))
 (:goal  (and 
    (clear b5)
    (on b5 b4)
    (on b4 b1)
    (on b1 b6)
    (on b6 b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b32 b57)
   deleted: (on b32 b57) (clear b32) (arm-empty)
   added: (holding b32) (clear b57)
   goals met: 0 of 7
2. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 0 of 7
3. (unstack b57 b47)
   deleted: (on b57 b47) (clear b57) (arm-empty)
   added: (holding b57) (clear b47)
   goals met: 0 of 7
4. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 0 of 7
5. (unstack b47 b22)
   deleted: (on b47 b22) (clear b47) (arm-empty)
   added: (holding b47) (clear b22)
   goals met: 0 of 7
6. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 0 of 7
7. (unstack b22 b3)
   deleted: (on b22 b3) (clear b22) (arm-empty)
   added: (holding b22) (clear b3)
   goals met: 0 of 7
8. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 7
9. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 1 of 7
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 7
11. (unstack b30 b6)
   deleted: (on b30 b6) (clear b30) (arm-empty)
   added: (holding b30) (clear b6)
   goals met: 1 of 7
12. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 1 of 7
13. (unstack b6 b48)
   deleted: (on b6 b48) (clear b6) (arm-empty)
   added: (holding b6) (clear b48)
   goals met: 1 of 7
14. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 2 of 7
15. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 1 of 7
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 7
17. (unstack b9 b2)
   deleted: (on b9 b2) (clear b9) (arm-empty)
   added: (holding b9) (clear b2)
   goals met: 2 of 7
18. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 7
19. (unstack b2 b23)
   deleted: (on b2 b23) (clear b2) (arm-empty)
   added: (holding b2) (clear b23)
   goals met: 2 of 7
20. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 3 of 7
21. (unstack b49 b52)
   deleted: (on b49 b52) (clear b49) (arm-empty)
   added: (holding b49) (clear b52)
   goals met: 3 of 7
22. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 3 of 7
23. (unstack b52 b41)
   deleted: (on b52 b41) (clear b52) (arm-empty)
   added: (holding b52) (clear b41)
   goals met: 3 of 7
24. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 3 of 7
25. (unstack b41 b37)
   deleted: (on b41 b37) (clear b41) (arm-empty)
   added: (holding b41) (clear b37)
   goals met: 3 of 7
26. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 3 of 7
27. (unstack b37 b1)
   deleted: (on b37 b1) (clear b37) (arm-empty)
   added: (holding b37) (clear b1)
   goals met: 3 of 7
28. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 7
29. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 3 of 7
30. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 4 of 7
31. (unstack b23 b51)
   deleted: (on b23 b51) (clear b23) (arm-empty)
   added: (holding b23) (clear b51)
   goals met: 4 of 7
32. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 4 of 7
33. (unstack b51 b14)
   deleted: (on b51 b14) (clear b51) (arm-empty)
   added: (holding b51) (clear b14)
   goals met: 4 of 7
34. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 7
35. (unstack b14 b34)
   deleted: (on b14 b34) (clear b14) (arm-empty)
   added: (holding b14) (clear b34)
   goals met: 4 of 7
36. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 7
37. (unstack b34 b35)
   deleted: (on b34 b35) (clear b34) (arm-empty)
   added: (holding b34) (clear b35)
   goals met: 4 of 7
38. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 4 of 7
39. (unstack b35 b17)
   deleted: (on b35 b17) (clear b35) (arm-empty)
   added: (holding b35) (clear b17)
   goals met: 4 of 7
40. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 4 of 7
41. (unstack b17 b19)
   deleted: (on b17 b19) (clear b17) (arm-empty)
   added: (holding b17) (clear b19)
   goals met: 4 of 7
42. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 4 of 7
43. (unstack b19 b13)
   deleted: (on b19 b13) (clear b19) (arm-empty)
   added: (holding b19) (clear b13)
   goals met: 4 of 7
44. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 4 of 7
45. (unstack b13 b4)
   deleted: (on b13 b4) (clear b13) (arm-empty)
   added: (holding b13) (clear b4)
   goals met: 4 of 7
46. (stack b13 b51)
   deleted: (clear b51) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b51)
   goals met: 4 of 7
47. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 3 of 7
48. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 5 of 7
49. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 4 of 7
50. (stack b1 b47)
   deleted: (clear b47) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b47)
   goals met: 4 of 7
51. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 3 of 7
52. (stack b6 b41)
   deleted: (clear b41) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b41)
   goals met: 3 of 7
53. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 7
54. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 4 of 7
55. (unstack b6 b41)
   deleted: (on b6 b41) (clear b6) (arm-empty)
   added: (holding b6) (clear b41)
   goals met: 4 of 7
56. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 5 of 7
57. (unstack b1 b47)
   deleted: (on b1 b47) (clear b1) (arm-empty)
   added: (holding b1) (clear b47)
   goals met: 5 of 7
58. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 6 of 7
59. (unstack b5 b4)
   deleted: (on b5 b4) (clear b5) (arm-empty)
   added: (holding b5) (clear b4)
   goals met: 4 of 7
60. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 7
61. (unstack b4 b55)
   deleted: (on b4 b55) (clear b4) (arm-empty)
   added: (holding b4) (clear b55)
   goals met: 5 of 7
62. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 6 of 7
63. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 7
64. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 7
